In [1]:
import pandas as pd
import sklearn

In [2]:
data = pd.read_csv("data/salary.csv")
data.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
# input data for our model
input = data.drop("salary_more_then_100k", axis="columns")
input.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [4]:
# target data for the classification task
target = data["salary_more_then_100k"]
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [5]:
# lets encode the features in the input data
from sklearn.preprocessing import LabelEncoder

In [6]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [7]:
input["company_n"] = le_company.fit_transform(input["company"])
input["job_n"] = le_company.fit_transform(input["job"])
input["degree_n"] = le_company.fit_transform(input["degree"])
input.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [9]:
input = input.drop(["company", "job", "degree"], axis='columns')

In [10]:
input.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [11]:
from sklearn.tree import DecisionTreeClassifier

In [12]:
model = DecisionTreeClassifier()

In [18]:
# lets split the data into testing and training
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.1)

In [19]:
# train the model
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [20]:
model.score(X_test, y_test)

1.0

In [22]:
print(model.predict(X_test))
print(y_test)

[1 1]
15    1
12    1
Name: salary_more_then_100k, dtype: int64